In [1]:
import pandas as pd

In [2]:
# Series = 1-dimensional

In [3]:
# 2 main datatypes
series = pd.Series(["BMW", "Toyota", "Honda"])

In [4]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [5]:
colors = pd.Series(["Red", "Blue", "White"])

In [6]:
colors

0      Red
1     Blue
2    White
dtype: object

In [7]:
# DataFrame = 2-dimensional

In [8]:
car_data = pd.DataFrame({"Car make": series, "Color": colors})
car_data

  Car make  Color
0      BMW    Red
1   Toyota   Blue
2    Honda  White

In [9]:
# Import data
car_sales = pd.read_csv("car-sales.csv")

In [10]:
car_sales

     Make  Color  Odometer  Doors  Price
0  Toyota  White    150043      4   4000
1   Honda    Red     87899      4   5000
2  Toyota   Blue     32549      3   7000
3     BMW  Black     11179      5  22000
4  Nissan  White    213095      4   3500
5  Toyota  Green     99213      4   4500
6   Honda   Blue     45698      4   7500
7   Honda   Blue     54738      4   7000
8  Toyota  White     60000      4   6250
9  Nissan  White     31600      4   9700

In [11]:
# Exporting a dataframe
car_sales.to_csv("exported-car-sales.csv", index=False)

In [12]:
exported_car_sales = pd.read_csv("exported-car-sales.csv")
exported_car_sales

     Make  Color  Odometer  Doors  Price
0  Toyota  White    150043      4   4000
1   Honda    Red     87899      4   5000
2  Toyota   Blue     32549      3   7000
3     BMW  Black     11179      5  22000
4  Nissan  White    213095      4   3500
5  Toyota  Green     99213      4   4500
6   Honda   Blue     45698      4   7500
7   Honda   Blue     54738      4   7000
8  Toyota  White     60000      4   6250
9  Nissan  White     31600      4   9700

In [13]:
# Import data from URL
heart_disease = pd.read_csv("https://raw.githubusercontent.com/jjuniorc/tensorflow/main/heart-disease.csv")
heart_disease

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0